УчетВУправляющихДляГит1/src/InformationRegisters/ПорядокНалогообложенияТорговыхТочек/ПорядокНалогообложенияТорговыхТочек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокНалогообложенияТорговыхТочек</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ОсобыйПорядокНалогообложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/ПорядокНалогообложенияТорговыхТочек/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция ОсобыйПорядокНалогообложенияНаСкладе(Склад, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПорядокНалогообложенияТорговыхТочекСрезПоследних.ОсобыйПорядокНалогообложения
	|ИЗ
	|	РегистрСведений.ПорядокНалогообложенияТорговыхТочек.СрезПоследних(&Дата, Склад = &Склад) КАК ПорядокНалогообложенияТорговыхТочекСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда 
		Возврат Ложь;
	Иначе
		Возврат Результат[0].ОсобыйПорядокНалогообложения;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
